---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.Clear
source: html/569f7861-5aa5-a4c7-3b23-fc49f513ff71.htm
---
# Autodesk.Revit.DB.MullionTypeSet.Clear Method

Removes every mullion type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```